## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-loadtesting.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/wayofthesys-cinema-363715/locations/us-central1/clusters/loadtesting"
        name                        = "loadtesting"
        # (27 unchanged attributes hidden)

-       node_config {
-           disk_size_gb      = 20 -> null
-           disk_type         = "pd-standard" -> null
-           guest_accelerator = [] -> null
-           image_type        = "COS_CONTAINERD" -> null
-           labels            = {
-               "cluster_name" = "loadtesting"
-               "node_pool"    = "core"
            } -> null
-           local_ssd_count   = 1 -> null
-           machine_type      = "n2-highmem-8" -> null
-           metadata          = {
-               "cluster_name"             = "loadtesting"
-               "disable-legacy-endpoints" = "true"
-               "node_pool"                = "core"
            } -> null
-           oauth_scopes      = [
-               "https://www.googleapis.com/auth/logging.write",
-               "https://www.googleapis.com/auth/monitoring",
            ] -> null
-           preemptible       = true -> null
-           service_account   = "terrateam-tf@wayofthesys-cinema-363715.iam.gserviceaccount.com" -> null
-           spot              = false -> null
-           tags              = [
-               "gke-loadtesting",
-               "gke-loadtesting-core",
            ] -> null
-           taint             = [] -> null

-           shielded_instance_config {
-               enable_integrity_monitoring = true -> null
-               enable_secure_boot          = false -> null
            }

-           workload_metadata_config {
-               mode = "GKE_METADATA" -> null
            }
        }

-       node_pool {
-           initial_node_count          = 4 -> null
-           instance_group_urls         = [
-               "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema-363715/zones/us-central1-a/instanceGroupManagers/gke-loadtesting-core-e1c963af-grp",
            ] -> null
-           managed_instance_group_urls = [
-               "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema-363715/zones/us-central1-a/instanceGroups/gke-loadtesting-core-e1c963af-grp",
            ] -> null
-           max_pods_per_node           = 65 -> null
-           name                        = "core" -> null
-           node_count                  = 4 -> null
-           node_locations              = [
-               "us-central1-a",
            ] -> null
-           version                     = "1.24.5-gke.600" -> null

-           autoscaling {
-               max_node_count       = 3 -> null
-               min_node_count       = 1 -> null
-               total_max_node_count = 0 -> null
-               total_min_node_count = 0 -> null
            }

-           management {
-               auto_repair  = true -> null
-               auto_upgrade = true -> null
            }

-           node_config {
-               disk_size_gb      = 20 -> null
-               disk_type         = "pd-standard" -> null
-               guest_accelerator = [] -> null
-               image_type        = "COS_CONTAINERD" -> null
-               labels            = {
-                   "cluster_name" = "loadtesting"
-                   "node_pool"    = "core"
                } -> null
-               local_ssd_count   = 1 -> null
-               machine_type      = "n2-highmem-8" -> null
-               metadata          = {
-                   "cluster_name"             = "loadtesting"
-                   "disable-legacy-endpoints" = "true"
-                   "node_pool"                = "core"
                } -> null
-               oauth_scopes      = [
-                   "https://www.googleapis.com/auth/logging.write",
-                   "https://www.googleapis.com/auth/monitoring",
                ] -> null
-               preemptible       = true -> null
-               service_account   = "terrateam-tf@wayofthesys-cinema-363715.iam.gserviceaccount.com" -> null
-               spot              = false -> null
-               tags              = [
-                   "gke-loadtesting",
-                   "gke-loadtesting-core",
                ] -> null
-               taint             = [] -> null

-               shielded_instance_config {
-                   enable_integrity_monitoring = true -> null
-                   enable_secure_boot          = false -> null
                }

-               workload_metadata_config {
-                   mode = "GKE_METADATA" -> null
                }
            }

-           upgrade_settings {
-               max_surge       = 1 -> null
-               max_unavailable = 0 -> null
            }
        }

        # (17 unchanged blocks hidden)
    }

  # module.gke-loadtesting.google_container_node_pool.pools["core"] has been deleted
-   resource "google_container_node_pool" "pools" {
-       cluster            = "loadtesting" -> null
-       id                 = "projects/wayofthesys-cinema-363715/locations/us-central1/clusters/loadtesting/nodePools/core" -> null
-       initial_node_count = 4 -> null
-       location           = "us-central1" -> null
-       name               = "core" -> null
-       node_locations     = [
-           "us-central1-a",
        ] -> null
-       project            = "wayofthesys-cinema-363715" -> null

-       autoscaling {
-           max_node_count       = 3 -> null
-           min_node_count       = 1 -> null
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
        }

-       management {
-           auto_repair  = true -> null
-           auto_upgrade = true -> null
        }

-       node_config {
-           disk_size_gb      = 20 -> null
-           disk_type         = "pd-standard" -> null
-           guest_accelerator = [] -> null
-           image_type        = "COS_CONTAINERD" -> null
-           labels            = {
-               "cluster_name" = "loadtesting"
-               "node_pool"    = "core"
            } -> null
-           local_ssd_count   = 1 -> null
-           machine_type      = "n2-highcpu-4" -> null
-           metadata          = {
-               "cluster_name"             = "loadtesting"
-               "disable-legacy-endpoints" = "true"
-               "node_pool"                = "core"
            } -> null
-           oauth_scopes      = [
-               "https://www.googleapis.com/auth/logging.write",
-               "https://www.googleapis.com/auth/monitoring",
            ] -> null
-           preemptible       = true -> null
-           service_account   = "terrateam-tf@wayofthesys-cinema-363715.iam.gserviceaccount.com" -> null
-           spot              = true -> null
-           tags              = [
-               "gke-loadtesting",
-               "gke-loadtesting-core",
            ] -> null
-           taint             = [] -> null

-           shielded_instance_config {
-               enable_integrity_monitoring = true -> null
-               enable_secure_boot          = false -> null
            }

-           workload_metadata_config {
-               mode = "GKE_METADATA" -> null
            }
        }

-       timeouts {
-           create = "45m" -> null
-           delete = "45m" -> null
-           update = "45m" -> null
        }

-       upgrade_settings {
-           max_surge       = 1 -> null
-           max_unavailable = 0 -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # module.gke-loadtesting.google_container_node_pool.pools["core"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "loadtesting"
+       id                          = (known after apply)
+       initial_node_count          = 1
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "core"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-a",
        ]
+       operation                   = (known after apply)
+       project                     = "wayofthesys-cinema-363715"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 3
+           min_node_count = 1
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 20
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "loadtesting"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 1
+           machine_type      = "n2-highcpu-4"
+           metadata          = {
+               "cluster_name"             = "loadtesting"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = true
+           service_account   = "terrateam-tf@wayofthesys-cinema-363715.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-loadtesting",
+               "gke-loadtesting-core",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 635.76 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 635.76 | 635.76|
| | **Total** | **0.00** | **635.76** | **635.76** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
